app/views/movies/index.html.erb

	    <th>
		    <%= link_to 'Movie Title', movies_path({:sort => 'title', :sort_ratings => Hash[@ratings_to_show.collect{ |rate| [rate, 1] }] }), :id => 'title_header', :class => @title_class %>
---
SELECT "movies".* FROM "movies" WHERE (rating = 'G')  ORDER BY "movies"."title" ASC